app/controllers/blogs_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    render json: Post.all

INSERT INTO "posts" ("p_name", "p_type", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["p_name", "C"], ["p_type", "programming"], ["user_id", 1], ["created_at", "2024-01-29 11:04:34.869152"], ["updated_at", "2024-01-29 11:04:34.869152"]]
---
  def create
    @post = Post.new("p_name": params[:p_name],"p_type": params[:p_type],"user_id": params[:user_id])
    if @post.save

UPDATE "posts" SET "p_name" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["p_name", "sour"], ["updated_at", "2024-01-29 10:13:39.751940"], ["id", 4]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def update
    if Post.update(params[:id],"p_name": params[:p_name])
      render json: Post.find(params[:id])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
---
  def destroy
    if Post.delete(params[:id])